Revit 2027 API
ParameterValueProvider.Parameter Property
 The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Parameter { get; set; }
Public Property Parameter As ElementId
	Get
	Set
public:
property ElementId^ Parameter {
	ElementId^ get ();
	void set (ElementId^ value);
}
member Parameter : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ParameterValueProvider Class
Autodesk.Revit.DB Namespace